Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ཕྱིན་ཅི་ལོག་ལས་བྱུང་བའི་ཕུང་པོ་ལྔ་དག་ནི་ཡོད་དོ། །
en: The five aggregates that arise from the distorted views exist.

source: རྒྱུ་མེད་པ་ལས་ཆོས་འབྱུང་བ་ནི་མེད་དོ། །
en: Things that arise without a cause do not exist.

source: གཞན་ཡང་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། འགྱུར་བའི་ཆོས་ཅན་གྱི་གཟུགས་ནི་ཡོད་དོ། །
en: “Moreover, a form that is impermanent, causes suffering, and is subject to change exists.

source: རྟག་པ་དང་། བརྟན་པ་དང་། ཐེར་ཟུག་དང་མི་འགྱུར་བའི་ཆོས་ཅན་དང་། ཡང་དག་པར་དེ་བཞིན་ཉིད་དུ་གནས་པའི་གཟུགས་དེ་ནི་མེད་དོ། །
en: A form that is established in accordance with the way things truly are as being permanent, stable, eternal, and not subject to change does not exist.

source: དེ་བཞིན་དུ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། འགྱུར་བའི་ཆོས་ཅན་གྱི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ནི་ཡོད་དོ། །
en: In the same way, a feeling, conception, latent tendency, or consciousness that is impermanent, causes suffering, and is subject to change exists.

source: རྟག་པ་དང་། བརྟན་པ་དང་། ཐེར་ཟུག་དང་། མི་འགྱུར་བའི་ཆོས་ཅན་དང་། ཡང་དག་པར་དེ་བཞིན་ཉིད་དུ་གནས་པའི་རྣམ་པར་ཤེས་པ་དེ་ནི་མེད་དོ། །
en: A feeling, conception, latent tendency, or consciousness that is established in accordance with the way things truly are as being permanent, stable, eternal, and not subject to change does not exist.

source: གཞན་ཡང་མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་ཞེས་བྱ་བ་དེ་དག་ནི་ཡོད་དོ། །
en: “Moreover, what are called latent tendencies, which have ignorance as the condition, exist.

source: མ་རིག་པ་མེད་ན་འདུ་བྱེད་རྣམས་ཞེས་བྱ་བ་དེ་དག་མེད་དོ། །
en: When ignorance does not exist, then what are called latent tendencies do not exist.

source: འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །
en: What is called consciousness, which has latent tendencies as the condition, exists.

source: འདུ་བྱེད་རྣམས་མེད་ན་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་དེ་མེད་དོ། །
en: When latent tendencies do not exist, then what is called consciousness does not exist.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །
en: What are called name and form, which have consciousness as the condition, exist.

source: རྣམ་པར་ཤེས་པ་མེད་ན་མིང་དང་གཟུགས་ཞེས་བྱ་བ་ནི་མེད་དོ། །
en: When consciousness does not exist, then what are called name and form do not exist.

source: མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག་ཅེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །
en: What are called the six sense spheres, which have name and form as the condition, exist.

source: མིང་དང་གཟུགས་མེད་ན་སྐྱེ་མཆེད་དྲུག་ཅེས་བྱ་བ་དེ་མེད་དོ། །
en: When name and form do not exist, then what are called the six sense spheres do not exist.

source: སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །
en: What is called sense contact, which has the six sense spheres as the condition, exists.

source: སྐྱེ་མཆེད་དྲུག་མེད་ན་རེག་པ་ཞེས་བྱ་བ་དེ་མེད་དོ། །
en: When the six sense spheres do not exist, then what is called sense contact does not exist.

source: རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །
en: What is called feeling, which has sense contact as the condition, exists.

source: རེག་པ་མེད་ན་ཚོར་བ་ཞེས་བྱ་བ་དེ་མེད་དོ། །
en: When sense contact does not exist, then what is called feeling does not exist.

source: ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །
en: What is called craving, which has feeling as the condition, exists.

source: ཚོར་བ་མེད་ན་སྲེད་པ་ཞེས་བྱ་བ་དེ་མེད་དོ། །
en: When feeling does not exist, then what is called craving does not exist.

source: སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །
en: What is called clinging, which has craving as the condition, exists.

source: སྲེད་པ་མེད་ན་ལེན་པ་ཞེས་བྱ་བ་དེ་མེད་དོ། །
en: When craving does not exist, then what is called clinging does not exist.

source: ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །
en: What is called becoming, which has clinging as the condition, exists.

source: ལེན་པ་མེད་ན་སྲིད་པ་ཞེས་བྱ་བ་དེ་མེད་དོ། །
en: When clinging does not exist, then what is called becoming does not exist.

source: སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །
en: What is called birth, which has becoming as the condition, exists.

source: སྲིད་པ་མེད་ན་སྐྱེ་བ་ཞེས་བྱ་བ་དེ་མེད་དོ། །
en: When becoming does not exist, then what is called birth does not exist.

source: སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ནི་ཡོད་དོ། །
en: What are called old age and death, along with grief, lamentation, suffering, displeasure, and despair, which have birth as the condition, exist.

source: སྐྱེ་བ་མེད་ན་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་།
en: When birth does not exist, then what are called old age and death, along with grief, lamentation, suffering, displeasure, and despair, do not exist.

source: འཁྲུག་པ་རྣམས་མེད་དོ། །གཞན་ཡང་སྦྱིན་པས་ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བ་ནི་ཡོད་དོ། །
en: “Moreover, the development of great wealth through generosity exists.

source: སྦྱིན་པས་དབུལ་པོར་འགྱུར་བ་ནི་མེད་དོ། །
en: The development of poverty through generosity does not exist.

source: ཚུལ་ཁྲིམས་ཀྱིས་མཐོ་རིས་སུ་སྐྱེ་བ་ནི་ཡོད་དོ། །
en: Rebirth in the good realms through moral conduct exists.

source: ཚུལ་ཁྲིམས་ཀྱིས་ངན་སོང་དུ་སྐྱེ་བ་ནི་མེད་དོ། །
en: Rebirth in the bad realms through moral conduct does not exist.

source: ཐོས་པས་ཤེས་རབ་ཆེན་པོར་འགྱུར་བ་ནི་ཡོད་དོ། །
en: The development of great wisdom through learning exists.

source: ཐོས་པས་ཤེས་རབ་འཆལ་བར་འགྱུར་བ་ནི་མེད་དོ། །
en: The development of faulty powers of discrimination through learning does not exist.

source: བསྒོམ་པས་འབྲལ་བར་འགྱུར་བ་ནི་ཡོད་དོ། །
en: The development of freedom through meditative cultivation exists.

source: བསྒོམ་པས་འབྲལ་བར་མི་འགྱུར་བ་ནི་མེད་དོ། །
en: The development of bondage through meditative cultivation does not exist.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་ལྡན་ན་ཉོན་མོངས་པ་འབྱུང་བ་ནི་ཡོད་དོ། །
en: The arising of afflictions for one who does not pay careful attention exists.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་བྲལ་ན་ཉོན་མོངས་པ་འབྱུང་བ་ནི་མེད་དོ། །
en: The arising of afflictions for one who does pay careful attention does not exist.

source: མངོན་པའི་ང་རྒྱལ་ཅན་ལ་ནི་ཀུན་ཤེས་པ་བརྡ་སྤྲོད་པ་མེད་དོ། །
en: “For those who have self-conceit, a prediction of perfect knowledge does not exist.

source: མངོན་པའི་ང་རྒྱལ་མེད་པ་ལ་ནི་མྱ་ངན་ལས་འདས་པ་ཡོད་དོ། །
en: For those who do not have self-conceit, cessation exists.

source: གཞན་ཡང་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་སྟོང་པ་ཉིད་ཡོད་དོ། །
en: “Moreover, all-pervasive emptiness exists.

source: ནང་གི་རྗེས་སུ་སོང་བའི་བདག་ནི་མེད་དོ། །
en: A self that pervades an individual does not exist.

source: ཡེ་ཤེས་དང་ལྡན་པ་ལ་ནི་ཐར་པ་ཡོད་དོ། །
en: For those who have knowledge, liberation exists.

source: ང་རྒྱལ་དང་ལྡན་པ་ལ་ནི་འབྱུང་བ་མེད་དོ། །
en: For those who are proud, freedom does not exist.

source: བདག་གམ། སེམས་ཅན་ནམ། སྲོག་གམ། གང་ཟག་ཅེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་མེད་དོ། །
en: That which is called a self, a being, a life force, and an individual does not exist.

source: གསང་བ་པའི་བདག་པོ་དེ་ལྟར་ན་བག་ཡོད་པ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་ན་མཁས་པ་རྣམས་ལ་ཡོད་པར་གྲགས་པ་གང་ཡིན་པ་དེ་ནི་ཡོད་པར་རབ་ཏུ་ཤེས་སོ། །
en: “Bodhisattvas who are watchful and pay careful attention, Lord of the Guhyakas, know that those things exist which those in the world who are wise say exist.

source: འཇིག་རྟེན་ན་མཁས་པ་རྣམས་ལ་མེད་པར་གྲགས་པ་གང་ཡིན་པ་དེ་ནི་མེད་པར་རབ་ཏུ་ཤེས་སོ། །
en: They know that those things do not exist which those in the world who are wise say do not exist.

source: དེ་ཡོད་དོ་ཞེས་ཐ་སྙད་འདོགས་པ་ལ་ཡང་མི་ཆགས་སོ། །མེད་དོ་ཞེས་ཐ་སྙད་འདོགས་པ་ལ་ཡང་མི་ཆགས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གསུངས་པ་ཡང་དག་པའི་དོན་རྗེས་སུ་རྟོགས་སོ། །
en: They are not attached to the conventional expression ‘that exists.’ They are not attached to the conventional expression ‘that does not exist.’ They understand the correct meaning of what is taught by the blessed buddhas.

source: གསང་བ་པའི་བདག་པོ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མདོར་བསྡུས་ཏེ། ཆོས་ཀྱི་མདོ་བཞིར་རྣམ་པར་གཞག་གོ། །
en: “When the realized ones give a concise outline of all things, Lord of the Guhyakas, they lay out a set of the four statements of the Dharma.

source: དགེ་སྦྱོང་དང་།
en: First, all conditioned things are impermanent.

source: བྲམ་ཟེ་རྟག་པར་སྨྲ་བ་རྣམས་དང་། ལྷ་ཚེ་རིང་པོ་རྟག་པར་འདུ་ཤེས་པ་རྣམས་ཀྱི་གཞོམ་པའི་ཕྱིར་འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་གོ་ཞེས་བྱ་བ་དང་།
en: This is stated in order to defeat ascetics and brahmins who speak of permanence and those who have the idea that the long-lived gods are eternal.

source: ལྷ་དང་མི་བདེ་བར་འདུ་ཤེས་པ་རྣམས་ཀྱི་གཞོམ་པའི་ཕྱིར་འདུ་བྱེད་ཐམས་ཅད་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་།
en: Second, all conditioned things are suffering. This is stated in order to defeat those that have the idea that gods and humans are happy.

source: མུ་སྟེགས་ཅན་བདག་ཏུ་སྨྲ་བ་རྣམས་ཀྱི་གཞོམ་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་།
en: Third, all things are without self. This is stated in order to defeat those rival teachers who assert that there is a self.

source: རྣམ་པར་རྟོག་པ་ལ་སྤྱོད་པ་མངོན་པའི་ང་རྒྱལ་ཅན་རྣམས་ཀྱི་གཞོམ་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ནི་ཞི་བ་ཞེས་བྱ་བའོ། །
en: Fourth, nirvāṇa is peace. This is said in order to defeat those with self-conceit who engage in vain ruminations.

source: གསང་བ་པའི་བདག་པོ་མི་རྟག་ཅེས་བྱ་བ་དེ་ནི་ཤིན་ཏུ་མི་རྟག་པའི་དོན་གྱི་ཚིག་བླ་དགས་སོ། །
en: “What is called impermanence, Lord of the Guhyakas, is a designation with the meaning of momentariness.

source: སྡུག་བསྔལ་ཞེས་བྱ་བ་དེ་ནི་སྨོན་པ་དང་བྲལ་བའི་ཚིག་བླ་དགས་སོ། །
en: What is called suffering is a designation for being without desire.

source: བདག་མེད་ཅེས་བྱ་བ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ། །
en: What is called being without self is a designation for the defining characteristic of emptiness.

source: མྱ་ངན་ལས་འདས་པ་ནི་ཞི་བའོ། །ཞེས་བྱ་བ་དེ་ནི་མཚན་མ་མེད་པ་མངོན་དུ་བྱ་བའི་ཚིག་བླ་དགས་སོ། །
en: The statement nirvāṇa is peace is a designation for the direct realization of groundlessness.

source: གསང་བ་པའི་བདག་པོ་དེ་ལྟར་ན་ཆོས་ཐམས་ཅད་ལ་དེ་ལྟར་མོས་ཤིང་། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགེ་བ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལས་མི་ཉམས་ཤིང་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ཏེ།
en: “Bodhisattvas who are thus inclined toward all things in this way and who pay careful attention, Lord of the Guhyakas, do not neglect the qualities that are conducive to awakening, or allow them to become ruined.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱང་མྱུར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: Indeed, they quickly bring to completion all the qualities of a buddha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇིག་རྟེན་སྐྱོང་བ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At this point, the Four Great Kings, who are the protectors of the world, spoke to the Blessed One.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་བདག་ཅག་འཇིག་རྟེན་སྐྱོང་བ་ཞེས་བགྱི་ན།
en: “Blessed One,” they said, “it is said that we, the Four Great Kings, are the protectors the world.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཇི་ལྟར་འཇིག་རྟེན་བསྐྱང་བར་བགྱི།
en: How should we protect the world, Blessed One?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་སྐྱོང་བ་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གྲོགས་པོ་དག་ཁྱེད་ཀྱིས་ཆོས་ཀྱི་བྱ་བས་འཇིག་རྟེན་སྐྱོངས་ཤིག །
en: The Blessed One then responded to the Four Great Kings, the protectors of the world, saying, “Friends, you should protect the world with deeds of the Dharma.

source: དེ་ལ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །
en: In this respect, those who walk the path of the ten forms of good conduct protect the world.

source: བཅུ་གང་ཞེ་ན།
en: What are the ten forms?

source: འདི་ལྟ་སྟེ། སྲོག་གཅོད་པ་སྤང་བ་དང་།
en: They are as follows: you renounce the taking of life;

source: རང་གི་ལོངས་སྤྱོད་ཀྱིས་ཆོག་པར་འཛིན་པ་དང་།
en: you remain satisfied with your own wealth;

source: གཞན་གྱི་ཆུང་མ་དག་ལ་མི་འཕྱོ་བ་དང་།
en: you do not fly around with the wives of others;

source: ཆོས་སྤྱོད་པ་རྣམས་ལ་བདེན་པ་ཉིད་དང་།
en: you are truthful to those who practice the Dharma;

source: གཞན་གྱི་འཁོར་མི་འབྱེད་པ་དང་།
en: you do not divide other communities;

source: ཐ་བའི་ཚིག་མེད་དེ་ཞེར་མི་འདེབས་པ་དང་།
en: you do not sow discord by using harsh speech;

source: ཚིག་ཙམ་ཇི་ལྟ་བ་བཞིན་ཏེ། གཞན་ལ་མི་སླུ་བ་དང་།
en: you use only the words that are necessary and you do not deceive others;

source: གཞན་གྱི་ལོངས་སྤྱོད་ལ་འདོད་པ་མེད་པ་དང་།
en: you do not desire the wealth of others;

source: གནོད་སེམས་ཉེ་བར་ཞི་བ་དང་།
en: you calm feelings of ill will;

source: ལྟ་བ་ཡོངས་སུ་དག་ཅིང་ཡང་དག་པར་སོང་བ་སྟེ།
en: and you hold correct and pure views.

source: གྲོགས་པོ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །
en: Friends, those who walk the path of those ten forms of good conduct protect the world.

source: གྲོགས་པོ་དག་གཞན་ཡང་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའི་ཆོས་བརྒྱད་དེ།
en: “There are eight more things, friends, that protect the world.

source: བརྒྱད་གང་ཞེ་ན།
en: What are these eight things?

source: འདི་ལྟ་སྟེ། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་དང་།
en: They are as follows: just as one speaks, so does one act;

source: བླ་མ་ལ་གུས་པ་དང་།
en: one respects one’s teachers;

source: ཐམས་ཅད་དུ་འཐུན་པར་འཛིན་པ་དང་།
en: one treats everyone consistently;

source: དྲང་བ་དང་།
en: one is honest;

source: མཉེན་པ་དང་།
en: one is gracious;

source: སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་དང་ལྡན་པ་དང་།
en: one has thoughts of love toward all sentient beings;

source: སྡིག་པ་ཐམས་ཅད་མི་བྱེད་པ་དང་།
en: one does not do any bad deeds;

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པ་སྟེ།
en: and one gathers all the roots of virtue.

source: གྲོགས་པོ་དག་ཆོས་བརྒྱད་པོ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །
en: Friends, these eight things protect the world.

source: གྲོགས་པོ་དག་གཞན་ཡང་ཡང་དག་པར་མགུ་བར་བྱ་བའི་ཆོས་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པ་དྲུག་སྟེ།
en: “There are also six things that bring total satisfaction, friends, and these things protect the world, too.

source: དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these six things?

source: སྟོན་པ་དང་། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་མཁས་པ་རྣམས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་ལུས་ཀྱི་ལས་འདི་ནི་ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། ཡིད་དུ་འོང་བར་བྱེད་པ་དང་།
en: The first thing that brings total satisfaction is conduct with one’s body that shows love for the teacher, for the wise ones who lead the holy life, and for all beings.

source: དགའ་བར་བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། གུས་པར་བྱ་བ་དང་། བསྒོམ་པ་དང་། བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བར་འགྱུར་བ་དང་པོའོ། །དེ་བཞིན་དུ་སྟོན་པ་དང་།
en: It satisfies them, shows them respect, and pleases them, and the cultivation of actions that satisfy, show respect, and please them attracts others and makes them ready for meditative concentration.

source: ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་མཁས་པ་རྣམས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་ངག་དང་། ཡིད་ཀྱི་ལས་འདི་ནི་ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། ཡིད་དུ་འོང་བར་བྱེད་པ་དང་།
en: “Similarly, the second and third things that bring total satisfaction are conduct with one’s speech and conduct with one’s mind that show love for the teacher, for the wise ones who lead the holy life, and for all beings.

source: དགའ་བར་བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། གུས་པར་བྱ་བ་དང་། བསྒོམ་པ་དང་། བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བར་འགྱུར་བ་གཉིས་པ་དང་གསུམ་པའོ། །
en: They satisfy them, show them respect, and please them, and the cultivation of actions that satisfy, show respect, and please them attracts others and makes them ready for meditative concentration.

source: རྙེད་པ་གང་དག་ཆོས་དང་འཐུན་པ། ཆོས་ཀྱི་རྙེད་པ་ཐ་ན་ལྷུང་བཟེད་ཀྱི་ནང་དུ་ཆུད་པའམ། ལྷུང་བཟེད་པར་གཏོགས་པ་དེ་ལྟ་བུའི་རྙེད་པ་དག་གིས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་མཁས་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྙེད་པ་འཐུན་པར་བྱའོ་སྙམ་པ་འདི་ནི་ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་།
en: “The fourth thing that brings total satisfaction is the intent to share whatever one has obtained in accordance with the Dharma, including even those virtuous offerings that have been placed in one’s alms bowl, with the wise ones who lead the holy life.

source: ཡིད་དུ་འོང་བར་བྱེད་པ་དང་། དགའ་བར་བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། གུས་པར་བྱ་བ་དང་། བསྒོམ་པ་དང་། བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བར་འགྱུར་བ་བཞི་པའོ། །ཚུལ་ཁྲིམས་མ་ཉམས་པ། སྐྱོན་མེད་པ། འདྲེན་མ་མ་ཡིན་པ།
en: It satisfies them, shows them respect, and pleases them, and the cultivation of actions that satisfy, show respect, and please them attracts others and makes them ready for meditative concentration.

source: སྲ་སྲེ་མ་ཡིན་པ། རང་དབང་ཅན། མ་འབགས་པ། མཁས་པས་བསྔགས་པ། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་མཁས་པ་རྣམས་ཀྱིས་མ་སྨད་པ། གང་དག་ཡིན་པ་དེ་ལྟ་བུའི་ཚུལ་ཁྲིམས་རྣམས་ཀྱིས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་མཁས་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ཚུལ་ཁྲིམས་འཐུན་པར་བྱའོ། །སྙམ་པ་འདི་ནི་ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། མགུ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་།
en: “The fifth thing that brings total satisfaction is the intent to uphold moral conduct together with the wise ones who lead the holy life, a moral conduct that is persistent, flawless, pure, good, autonomous, undefiled, praised by the wise, and not condemned by the wise ones who lead the holy life.

source: ཡིད་དུ་འོང་བར་བྱེད་པ་དང་། དགའ་བར་བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། གུས་པར་བྱ་བ་དང་། བསྒོམ་པ་དང་།
en: It satisfies them, shows them respect, and pleases them, and the cultivation of actions that satisfy, show respect, and please them attracts others and makes them ready for meditative concentration.

source: བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བར་འགྱུར་བ་ལྔ་པའོ། །ལྟ་བ་གང་འཕགས་པ་ངེས་པར་འབྱུང་བ་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པ། དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བ་དང་། སྡུག་བསྔལ་མཐར་འབྱིན་པ་ངེས་པར་འབྱུང་བའི་ལྟ་བ་དེ་ལྟ་བུས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ལྟ་བ་འཐུན་པར་བྱའོ་སྙམ་པ་འདི་ནི་ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་།
en: “The sixth thing that brings total satisfaction is the intent to uphold the view that accords with the wise ones who lead the holy life—the view that is conducive to the forms of penetrating insight that are mastered by the noble ones, the view that completely eliminates suffering, the view of those adept at bringing suffering to an end.

source: བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བར་འགྱུར་བ་དྲུག་པ་སྟེ། གྲོགས་པོ་དག་ཡང་དག་པར་མགུ་བར་བྱ་བའི་ཆོས་དྲུག་པོ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །
en: These are the six things that bring total satisfaction, friends, and these things protect the world, too.

source: གྲོགས་པོ་དག་གཞན་ཡང་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའི་ཆོས་བཞི་སྟེ།
en: “There are four more things, friends, that protect the world.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these four things?

source: འདོད་པ་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། འཇིགས་པ་སྤངས་པས་འདོད་པས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་དང་། ཞེ་སྡང་གིས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་དང་།
en: They are as follows: lust, hatred, delusion, and fear—through the abandonment of these things one is not driven by lust onto a wrong course of action, one is not driven by hatred onto a wrong course of action, one is not driven by delusion onto a wrong course of action, and one is not driven by fear onto a wrong course of action.

source: གཏི་མུག་གིས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་དང་། འཇིགས་པས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་སྟེ། གྲོགས་པོ་དག་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་སྤངས་པའི་ཆོས་བཞི་པོ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །
en: These four things, friends—that is, the abandonment of the four wrong courses of action—protect the world.

source: གྲོགས་པོ་དག་གཞན་ཡང་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའི་ཆོས་གཉིས་ཏེ།
en: “There are two more things, friends, that protect the world.

source: གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these two things?

source: ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་སྟེ།
en: They are the following: a sense of shame and a feeling of remorse.

source: ཆོས་གཉིས་པོ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །
en: These two things protect the world.

source: གྲོགས་པོ་དག་གཞན་ཡང་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའི་ཆོས་ནི་གཅིག་ཁོ་ན་སྟེ།
en: “There are also some single things, friends, that protect the world. What are these things?

source: འདི་ལྟ་སྟེ། བདེན་པ་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པ།
en: They are the following: The truth protects the world.

source: བཀའ་བློ་བདེ་བ་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པ།
en: Speaking well protects the world.

source: གྱ་གྱུ་མེད་པ་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པ་སྟེ།
en: Guilelessness protects the world.

source: གྲོགས་པོ་དག་ཆོས་གཅིག་པོ་དེ་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །
en: These single things, friends, protect the world.

source: གྲོགས་པོ་དག་དེ་ལྟ་བུའི་ཆོས་ལ་བརྩོན་ན་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་དེ།
en: “If one practices these sets of things, friends, one protects the world.

source: གྲོགས་པོ་དག་ཁྱེད་ཀྱིས་ཆོས་དེ་ལྟ་བུ་ལ་བརྩོན་པས་འཇིག་རྟེན་སྐྱོངས་ཤིག །
en: Protect the world, friends, by practicing these sets of things.”

source: འཇིག་རྟེན་སྐྱོང་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་དགུ་པའོ།། །།
en: This was the nineteenth chapter, “The Protectors of the World.” Chapter 20: Going and Coming

source: དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ། གསང་སྔགས་ཀྱི་ཚིག་གང་དག་བརྗོད་པས་འཁོར་འདི་ཐམས་ཅད་དགེ་བ་དང་ལྡན་པར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འདི་ཡང་ཡུན་རིང་དུ་གནས་པར་འགྱུར་བའི་གསང་སྔགས་ཀྱི་ཚིག་དེ་དག་ངས་འཁོར་འདི་ལ་བརྗོད་པར་བྱའོ་སྙམ་ནས།
en: At that point, the Blessed One had the thought, “I should make it so that the words of a mantra are heard in this assembly, the articulation of which ensures the well-being of the entire assembly and ensures the long-term availability of the awakening of the realized ones, too.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། གསང་བ་པའི་བདག་པོ་ངས་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་ཀྱི་གནས་སུ་གསང་སྔགས་ཀྱི་ཚིག་གང་དག་སྨྲས་པ་དེ་དག་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པར་འདུག་ནས་འགྲོ་བ་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ངས་སེམས་ཀྱིས་དྲན་པས་གང་དག་སྨྲས་པ་དེ་དག་ཁྱེད་ཀྱིས་དྲན་ནམ།
en: The Blessed One then spoke to Vajrapāṇi, Lord of the Guhyakas: “Lord of the Guhyakas, do you remember the words of the mantra that were spoken by me in the abode of the nāga king Apalāla, which I recalled as I was at the supreme point of the seat of awakening and spoke again for the well-being and benefit of the world?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དྲན་ལགས་སོ། །
en: “Yes, I remember them, Blessed One.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གསང་བ་པའི་བདག་པོ་གསང་སྔགས་ཀྱི་ཚིག་དེ་དག་ལ་ཁྱོད་སྤོབས་པར་བྱོས་ཤིག །
en: The Blessed One then said, “Use your inspired eloquence, Lord of the Guhyakas, and speak the words of the mantra.”

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་སྟན་ལས་ལངས་ཏེ།
en: Vajrapāṇi, Lord of the Guhyakas, then rose from his seat.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཙོག་ཙོག་པོར་འདུག་ནས་ལག་པ་གཉིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་གཏུགས་ཏེ། གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་སོ། །འདི་ལྟ་སྟེ། ཨ་ཧུ་ལ། ཧུ་ལ་བ་ཏི། ཧུ་ལ་ར་ཎ། ཨ་གུ་ཧ། ཙ་ཙ་ཙ་ཙ་ཙ། ནི་ཥུ་ར་ཎ། ཀྵུ་ཏ་ཀྵུ་ཏ། ཀྵ་ཡ་ཀྵ་ཡ། ཨ་ཀྵ་ཡ་ས་མ། ཤ་མ་ནི་ཀ་ར། ཧ་ཧུ་ལ་ཧུ་བ་ཏི། ཁི་ལ་བ་ཏི། ཀི་ན་ཨ་བྷི་ཥི་ཏི། ནིས་ས་ར་ཎི།
en: Crouching down in front of the Blessed One, he touched the Blessed One’s feet with his hands, and then he spoke these words of the mantra as follows:

source: ཛ་ཛཱ་ཛ་ཛཱ་མ་ཏི། ཨ་བ་ཊཱ། ནི་བ་ཊཱ། བརྟ་བརྟ་ཨ་ནུ་ས་ར་ཎི། བྷུ་ཏ་ཨ་ནུ་སྨྲི་ཏི་ཧོ། མ་ནུ་ཥ་ཨ་ནུ་སྨྲྀ་ཏི་ཧོ། དེ་བ་ཨ་ནུ་སྨྲྀ་ཏི་ཧོ། ནཱ་ག་ནཱཾ། ཡཀྵཎཱཾ། གན་དྷརྦཱ་ནཱཾ། ཀིན་ན་རཱ་ཎཱཾ། མ་ཧོ་ར་གཱ་ནཱཾ། སྭ་སྟིར་བྷ་བན་ཏུ།
en: ahula | hulavati | hularaṇa | aguha | ca ca ca ca ca |niṣuraṇa | kṣuta kṣata | kṣaya kṣaya | akṣayasama | śamanikara | hahula huvati | khilavati | kina abhiṣiti | nissaraṇi | jajājajāmati | avaṭā | nivaṭā | varta varta anusariṇi | bhuta anusmṛti ho | manuṣa anusmṛti ho | deva anusmṛti ho | nāganāṃ | yakṣānāṃ | gandharvāṇāṃ | kinnarāṇāṃ | mahoragāṇāṃ | svastir bhavantu | sarvasattvānāṃ | vikirantu mahāparavat | saṃvyathatāṃ dhāraṇi | garjatu samudravega iti | |

source: སརྦ་སཏྭཱ་ནཱཾ། བི་ཀི་རན་ཏུ་མ་ཧཱ་པ་ར་བ་ཏ། སཾ་བྱ་ཐ་ཏཱཾ་དྷཱ་ར་ཎི། གརྫ་ཏུ་ས་མུ་དྲ་བེ་ག་ཨི་ཏི། གསང་སྔགས་ཀྱི་ཚིག་བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་གནས་ཐམས་ཅད་རབ་ཏུ་གཡོས་སོ། །
en: When he had set forth this teaching of the words of the mantra, all the divine abodes quaked.

source: ས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་གཡོས་སོ། །རྒྱ་མཚོ་ཆེན་པོ་ཡང་རབ་ཏུ་འཁྲུགས་སོ། །
en: The entire earth quaked, too, and the great ocean roiled.

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ཡང་འདར་པད་པད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་བར་གྱུར་ཏོ། །
en: The whole assembly trembled and fell down at the feet of the Blessed One.
